<?php

namespace num2word\NumberTransformer;


use num2word\Languages\Arabic;

class ArabicTest extends NumberTransformerTest
{
    public function setUp()
    {
        $this->numberTransformer = new Arabic();
    }

    public function providerTestNumberToWord()
    {
        return [
            ['0', 'صفر'],
            ['1', 'واحد'],
            ['8', 'ثمانية'],
            ['10', 'عشرة'],
            ['11', 'أحد عشر'],
            ['12', 'إثنا عشر'],
            ['16', 'ستة عشر'],
            ['19', 'تسعة عشر'],
            ['20', 'عشرون'],
            ['21', 'واحد وعشرون'],
            ['26', 'ستة وعشرون'],
            ['30', 'ثلاثون'],
            ['31', 'واحد وثلاثون'],
            ['39', 'تسعة وثلاثون'],
            ['40', 'أربعون'],
            ['41', 'واحد وأربعون'],
            ['45', 'خمسة وأربعون'],
            ['50', 'خمسون'],
            ['53', 'ثلاثة وخمسون'],
            ['57', 'سبعة وخمسون'],
            ['60', 'ستون'],
            ['61', 'واحد وستون'],
            ['70', 'سبعون'],
            ['71', 'واحد وسبعون'],
            ['80', 'ثمانون'],
            ['81', 'واحد وثمانون'],
            ['90', 'تسعون'],
            ['91', 'واحد وتسعون'],
            ['100', 'مئة'],
            ['101', 'مئة وواحد'],
            ['112', 'مئة وإثنا عشر'],
            ['120', 'مئة وعشرون'],
            ['200', 'مئتان'],
            ['1000', 'ألف'],
            ['1010', 'ألف وعشرة'],
            ['1102', 'ألف ومئة وإثنان'],
            ['2134', 'ألفان ومئة وأربعة وثلاثون'],
            ['10305', 'عشرة آلاف وثلاثة مئة وخمسة'],
            ['81912', 'واحد وثمانون ألف وتسعة مئة وإثنا عشر'],
            ['312005', 'ثلاثة مئة وإثنا عشر ألف وخمسة'],
            ['1000000', 'مليون'],
            ['20134013', 'عشرون مليون ومئة وأربعة وثلاثون ألف وثلاثة عشر'],
            ['1700000001', 'مليار وسبعة مئة مليون وواحد'],
            ['23450400123', 'ثلاثة وعشرون مليار وأربعة مئة وخمسون مليون وأربعة مئة ألف ومئة وثلاثة وعشرون'],
            ['988100467899', 'تسعة مئة وثمانية وثمانون مليار ومئة مليون وأربعة مئة وسبعة وستون ألف وثمانية مئة وتسعة وتسعون']
        ];
    }
}
